
class URLs:
    url = 'https://qa-scooter.praktikum-services.ru/'
    url_Dzen = 'https://dzen.ru'
    url_scooter = 'https://qa-scooter.praktikum-services.ru/'


class Answers:
    A_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    A_2 = ('Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать '
           'несколько заказов — один за другим.')
    A_3 = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды '
           'начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, '
           'суточная аренда закончится 9 мая в 20:30.')
    A_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    A_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    A_6 = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без '
           'передышек и во сне. Зарядка не понадобится.')
    A_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    A_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'


class DataOrder:
    DATA_SET_1 = {'name': 'Анастасия',
                  'last_name': 'Без',
                  'address': 'Петергофское шоссе 86 к 3, 425,',
                  'station': 'Сокольники',
                  'tel_num': '79867898789',
                  'order_data': '18.12.2024',
                  'comment': 'не звонить'
                  }
    DATA_SET_2 = {'name': 'Аня',
                  'last_name': 'Зеба',
                  'address': 'улица Якова 35',
                  'station': 'Сокольники',
                  'tel_num': '+79875674534',
                  'order_data': '30.11.2024',
                  'comment': ''
                  }
